Repository: bksubhuti/timefullness
Catalog: lib/l10n/app_*.arb
Languages: hi, km, lo, my, si, th, zh

# title
source: My Time Schedule
hi: माई टाइम शेड्यूल
km: កាលវិភាគរបស់ខ្ញុំ
lo: ແຜນການເວລາຂອງຂ້ອຍ
my: ကျွန်ုပ်၏အချိန်ဇယား
si: මගේ වේලාවන් සටහන
th: กำหนดเวลาของฉัน
zh: 我的时间表

source: Share
hi: साझा करें
km: ចែករំលែក
lo: ແບ່ງປັນ
my: မျှဝေမည်
si: බෙදාගන්න
th: แชร์
zh: 分享

source: Stop Timer
hi: टाइमर बंद करें
km: បញ្ឈប់គ្រោងពេល
lo: ຢຸດເວລາ
my: အချိန်တိုင်းစက်ရပ်မည်
si: ටයිමරය නවතන්න
th: หยุดจับเวลา
zh: 停止计时器

# settingsTitle
source: Settings
hi: सेटिंग्स
km: ការកំណត់
lo: ການຕັ້ງຄ່າ
my: ဆက်တင်များ
si: සැකසුම්
th: การตั้งค่า
zh: 设置

source: Timer Circle Color
hi: टाइमर सर्कल का रंग
km: ពណ៌រង្វង់ម៉ោង
lo: ສີວົງເວລາ
my: အချိန်စက်အရောင်
si: ටයිමරය වටයේ වර්ණය
th: สีวงจับเวลา
zh: 计时器圆圈颜色

source: Tap to select
hi: चयन करने के लिए टैप करें
km: ចុចដើម្បីជ្រើសរើស
lo: ແຕະເພື່ອເລືອກ
my: ရွေးရန်နှိပ်ပါ
si: තේරීම සඳහා තට්ටු කරන්න
th: แตะเพื่อเลือก
zh: 点击选择

source: Pick Timer Color
hi: टाइमर रंग चुनें
km: ជ្រើសពណ៌ម៉ោង
lo: ເລືອກສີຂອງເວລາ
my: အချိန်စက်အရောင်ရွေးပါ
si: ටයිමරය වර්ණය තෝරන්න
th: เลือกสีของตัวจับเวลา
zh: 选择计时器颜色

source: Close
hi: बंद करें
km: បិទ
lo: ປິດ
my: ပိတ်မည်
si: වසන්න
th: ปิด
zh: 关闭

source: Select Active Schedule
hi: सक्रिय शेड्यूल चुनें
km: ជ្រើសរើសកាលវិភាគសកម្ម
lo: ເລືອກແຜນການທີ່ໃຊ້ງານ
my: အသုံးပြုနေသောဇယားရွေးရန်
si: සක්‍රිය වැඩසටහන තෝරන්න
th: เลือกกำหนดเวลาที่ใช้งานอยู่
zh: 选择当前计划

# selectScheduleHint
source: Select Schedule
hi: शेड्यूल चुनें
km: ជ្រើសរើសកាលវិភាគ
lo: ເລືອກແຜນການ
my: ဇယားရွေးပါ
si: වැඩසටහන තෝරන්න
th: เลือกกำหนดเวลา
zh: 选择计划

source: Add
hi: जोड़ें
km: បន្ថែម
lo: ເພີ່ມ
my: ထည့်မည်
si: එක් කරන්න
th: เพิ่ม
zh: 添加

source: Rename
hi: नाम बदलें
km: ប្ដូរឈ្មោះ
lo: ປ່ຽນຊື່
my: အမည်ပြောင်းမည်
si: නම වෙනස් කරන්න
th: เปลี่ยนชื่อ
zh: 重命名

source: Delete
hi: हटाएं
km: លុប
lo: ລຶບ
my: ဖျက်မည်
si: මකන්න
th: ลบ
zh: 删除

source: Play sound when checked
hi: चेक करने पर ध्वनि चलाएँ
km: ចាក់សំឡេងនៅពេលបានសម្គាល់
lo: ວຽງສຽງເມື່ອຖືກໝາຍ
my: အချိန််ပြည့်လျှင်အသံြမည်မည်
si: සලකුණු කළ විට ශබ්දය වාදනය කරන්න
th: เล่นเสียงเมื่อทำเครื่องหมาย
zh: 勾选时播放声音

# playSoundSubtitle
source: Play a sound when marking a task as done
hi: कार्य को चिह्नित करते समय ध्वनि चलाएं
km: ចាក់សំឡេងនៅពេលបានសម្គាល់ការងារជាសម្រេច
lo: ວຽງສຽງເມື່ອໝາຍວ່າສໍາເລັດ
my: အလုပ်တစ်ခုပြီးပြီဟုပြသသည့်အခါအသံဖွင့်ပါ
si: ක්‍රියාවක් සලකුණු කළ විට ශබ්දයක් වාදනය කරන්න
th: เล่นเสียงเมื่อทำงานเสร็จ
zh: 标记任务完成时播放提示音

source: New Schedule Name
hi: नया शेड्यूल नाम
km: ឈ្មោះកាលវិភាគថ្មី
lo: ຊື່ແຜນການໃໝ່
my: ဇယားအမည်အသစ်
si: නව වැඩසටහනේ නම
th: ชื่อกำหนดเวลาใหม่
zh: 新计划名称

source: Enter schedule name
hi: शेड्यूल नाम दर्ज करें
km: បញ្ចូលឈ្មោះកាលវិភាគ
lo: ປ້ອນຊື່ແຜນການ
my: ဇယားအမည်ထည့်ပါ
si: වැඩ සටහනේ නම ඇතුළත් කරන්න
th: ป้อนชื่อกำหนดเวลา
zh: 输入计划名称

source: Cancel
hi: रद्द करें
km: បោះបង់
lo: ຍົກເລີກ
my: ဖျက်သိမ်းပါ
si: අවලංගු කරන්න
th: ยกเลิก
zh: 取消

source: Create
hi: बनाएं
km: បង្កើត
lo: ສ້າງ
my: ဖန်တီးမည်
si: නිර්මාණය කරන්න
th: สร้าง
zh: 创建

# scheduleExists
source: Schedule "{name}" already exists
hi: शेड्यूल "{name}" पहले से मौजूद है
km: កាលវិភាគ "{name}" មានរួចហើយ
lo: ແຜນການ "{name}" ມີຢູ່ແລ້ວ
my: ဇယား "{name}" ရှိပြီးဖြစ်ပါသည်
si: "{name}" වැඩසටහන දැනටමත් පවතී
th: กำหนดเวลา "{name}" มีอยู่แล้ว
zh: 计划 "{name}" 已存在

source: Rename Schedule
hi: शेड्यूल का नाम बदलें
km: ប្ដូរឈ្មោះកាលវិភាគ
lo: ປ່ຽນຊື່ແຜນການ
my: ဇယားအမည်ပြောင်းမည်
si: වැඩසටහනේ නම වෙනස් කරන්න
th: เปลี่ยนชื่อกำหนดเวลา
zh: 重命名计划

# newScheduleNameHint
source: New schedule name
hi: नई अनुसूची का नाम
km: ឈ្មោះកាលវិភាគថ្មី
lo: ຊື່ຕາຕະລາງໃໝ່
my: အချိန်ဇယားအမည်အသစ်
si: නව කාලසටහනේ නම
th: ชื่อกำหนดการใหม่
zh: 新计划名称

# youCannotRenameDefault
source: You cannot rename the default schedule.
hi: आप डिफ़ॉल्ट शेड्यूल का नाम नहीं बदल सकते।
km: អ្នកមិនអាចប្ដូរឈ្មោះកាលវិភាគដើមបានទេ។
lo: ທ່ານບໍ່ສາມາດປ່ຽນຊື່ແຜນການຕັ້ງຄ່າໄດ້
my: မူလဇယားကိုအမည်ပြောင်းလို့မရပါ။
si: පෙරනිමි වැඩසටහනේ නම වෙනස් කළ නොහැක.
th: คุณไม่สามารถเปลี่ยนชื่อกำหนดค่าเริ่มต้นได้
zh: 无法重命名默认计划。

# youCannotDeleteDefault
source: You cannot delete the default schedule.
hi: आप डिफ़ॉल्ट शेड्यूल को नहीं हटा सकते।
km: អ្នកមិនអាចលុបកាលវិភាគដើមបានទេ។
lo: ທ່ານບໍ່ສາມາດລຶບແຜນການຕັ້ງຄ່າໄດ້
my: မူလဇယားကိုဖျက်လို့မရပါ။
si: පෙරනිමි වැඩසටහන මකා දැමිය නොහැක.
th: คุณไม่สามารถลบกำหนดค่าเริ่มต้นได้
zh: 无法删除默认计划。

# deleteSchedulePrompt
source: Delete Schedule?
hi: शेड्यूल हटाएं?
km: លុបកាលវិភាគ?
lo: ລຶບແຜນການ?
my: ဇယားဖျက်မှာလား?
si: වැඩසටහන මකාදැමීමට?
th: ลบกำหนดเวลา?
zh: 删除计划？

# deleteScheduleConfirm
source: Are you sure you want to delete "{name}"?
hi: क्या आप वाकई "{name}" शेड्यूल हटाना चाहते हैं?
km: តើអ្នកប្រាកដជាចង់លុប "{name}"?
lo: ທ່ານແນ່ໃຈບໍ່ທີ່ຈະລຶບ "{name}"?
my: "{name}" ဇယားကိုဖျက်မည်မှာသေချာပါသလား?
si: "{name}" වැඩසටහන මකාදැමීම ඔබ තහවුරු කරනවාද?
th: คุณแน่ใจหรือไม่ว่าต้องการลบ "{name}"?
zh: 确定要删除 "{name}" 吗？

# confirmDelete
source: Delete
hi: हटाएं
km: លុប
lo: ລຶບ
my: ဖျက်မည်
si: මකන්න
th: ลบ
zh: 删除

source: Edit Schedule Item
hi: कार्य अनुसूची संपादित करें
km: កែសម្រួលកាលវិភាគ
lo: ແກ້ໄຂການຕາຕະລາງ
my: အချိန်ဇယားကို ပြင်ဆင်ပါ
si: වැඩසටහන සංස්කරණය කරන්න
th: แก้ไขกำหนดการ
zh: 编辑日程项

source: Add Schedule Item
hi: कार्य अनुसूची जोड़ें
km: បន្ថែមកាលវិភាគ
lo: ເພີ່ມການຕາຕະລາງ
my: အချိန်ဇယား အသစ်ထည့်ပါ
si: වැඩසටහනට එකතු කරන්න
th: เพิ่มกำหนดการ
zh: 添加日程项

# startLabel
source: Start
hi: प्रारंभ
km: ចាប់ផ្តើម
lo: ເລີ່ມ
my: စတင်ချိန်
si: ආරම්භය
th: เริ่ม
zh: 开始

source: not selected
hi: चयनित नहीं
km: មិនបានជ្រើសរើស
lo: ບໍ່ໄດ້ເລືອກ
my: မရွေးရသေးပါ
si: තෝරා නැත
th: ยังไม่ได้เลือก
zh: 未选择

source: Change
hi: परिवर्तन करें
km: ផ្លាស់ប្តូរ
lo: ປ່ຽນ
my: ပြောင်းရန်
si: වෙනස් කරන්න
th: เปลี่ยน
zh: 更改

# durationLabel
source: Duration
hi: अवधि
km: រយៈពេល
lo: ໄລຍະເວລາ
my: ကြာချိန်
si: කාලය
th: ระยะเวลา
zh: 持续时间

source: minutes
hi: मिनट
km: នាទី
lo: ນາທີ
my: မိနစ်
si: විනාඩි
th: นาที
zh: 分钟

# activityLabel
source: Activity
hi: गतिविधि
km: សកម្មភាព
lo: ກິດຈະກຳ
my: လုပ်ဆောင်ချက်
si: ක්‍රියාකාරකම
th: กิจกรรม
zh: 活动

source: Update
hi: अपडेट करें
km: ធ្វើបច្ចុប្បន្នភាព
lo: ອັບເດດ
my: အသစ်ပြင်ဆင်ရန်
si: යාවත්කාලීන කරන්න
th: อัปเดต
zh: 更新

source: Settings
hi: सेटिंग्स
km: ការកំណត់
lo: ການຕັ້ງຄ່າ
my: ဆက်တင်များ
si: සැකසුම්
th: การตั้งค่า
zh: 设置

source: Menu
hi: मेन्यू
km: ម៉ឺនុយ
lo: ເມນູ
my: မီနူး
si: මෙනුව
th: เมนู
zh: 菜单

# appName
source: My Time Schedule
hi: माय टाइम शेड्यूल
km: កាលវិភាគរបស់ខ្ញុំ
lo: ຕາຕະລາງຂອງຂ້ອຍ
my: အချိန်ဇယား
si: මගේ වේලාසටහනය
th: ตารางเวลาของฉัน
zh: 我的时间安排

# appVersion
source: Version 1.0.0
hi: संस्करण 1.0.0
km: កំណែ 1.0.0
lo: ສະບັບ 1.0.0
my: ဗားရှင်း 1.0.0
si: සංස්කරණය 1.0.0
th: เวอร์ชัน 1.0.0
zh: 版本 1.0.0

# appCopyright
source: © 2025 Bhikkhu Subhuti
hi: © 2025 भिक्षु सुभूति
km: © 2025 ភិក្ខុ សុភូធី
lo: © 2025 ພຣະພິກຂຸ ສຸພູຕິ
my: © 2025 ဘိက္ခု ဆုဘူထိ
si: © 2025 භික්ෂු සුභූති
th: © 2025 ภิกขุ สุภูติ
zh: © 2025 比丘 苏布提

# helpTitle
source: Help
hi: सहायता
km: ជំនួយ
lo: ຊ່ວຍເຫຼືອ
my: အကူအညီ
si: උදව්
th: ช่วยเหลือ
zh: 帮助

# helpText
source: • Schedule your entire day using focused 50-minute sessions. • Insert 10-minute breaks between sessions to maintain energy and focus. • Be sure to schedule free time — this is the most important part! By planning it, you manage it intentionally rather than losing it. • Tap the clock icon to start a timer for any scheduled activity. • Use the menu to access settings and customize your preferences.
hi: • अपने पूरे दिन को 50 मिनट के फोकस सत्रों के साथ शेड्यूल करें। • ऊर्जा और ध्यान बनाए रखने के लिए सत्रों के बीच 10 मिनट के ब्रेक डालें। • खाली समय को शेड्यूल करना न भूलें — यही सबसे महत्वपूर्ण हिस्सा है! इसे पहले से योजना बनाकर, आप इसे जानबूझकर प्रबंधित करते हैं। • किसी भी कार्य के लिए टाइमर शुरू करने के लिए घड़ी आइकन टैप करें। • सेटिंग्स और प्राथमिकताओं को अनुकूलित करने के लिए मेनू का उपयोग करें।
km: • រៀបចំថ្ងៃរបស់អ្នកទាំងមូលដោយប្រើវគ្គ ៥០ នាទី។ • បន្ថែមពេលសម្រាក ១០ នាទីរវាងវគ្គដើម្បីរក្សាទុកថាមពលនិងការផ្តោត។ • កុំភ្លេចរៀបចំពេលសម្រាក — នេះជាផ្នែកសំខាន់បំផុត! ដោយរៀបចំវាចំពោះមុខ អ្នកគ្រប់គ្រងវាដោយចេតនា។ • ចុចរូបនាឡិកាដើម្បីចាប់ផ្តើមការប្រុងប្រយ័ត្នសម្រាប់សកម្មភាពណាមួយ។ • ប្រើម៉ឺនុយដើម្បីចូលទៅកាន់ការកំណត់និងជម្រើសផ្សេងៗ។
lo: • ຈັດຕາຕະລາງວັນຂອງທ່ານໂດຍໃຊ້ຊ່ວງເວລາ 50 ນາທີຢ່າງເຕັ້ມທີ່。 • ໃສ່ເວລາພັກ 10 ນາທີລະຫວ່າງກິດຈະກຳເພື່ອຮັກສາກຳລັງແລະຄວາມໂຟກັດ。 • ຈົ່ງຢ່າລືມຈັດຕາຕະລາງເວລາວ່າງ — ນີ້ແມ່ນສ່ວນສຳຄັນທີ່ສຸດ! ດ້ວຍການວາງແຜນລ່ວງໜ້າ ທ່ານຈະສາມາດຄວບຄຸມເວລາໄດ້ດີກວ່າ。 • ກົດໄອຄອນນາລິກາເພື່ອເລີ່ມເວລາໃດກໍໄດ້ທີ່ທ່ານຈັດການ。 • ໃຊ້ເມນູເພື່ອເຂົ້າໄປຫາການຕັ້ງຄ່າແລະຕົວເລືອກຂອງທ່ານ.
my: • အချိန်ဇယားကို ၅၀ မိနစ်စီဖြင့် တိကျစွာ ချမှတ်ပါ။ • စွမ်းအင်နှင့် ဂရုပြုမှု တည်မြဲစေရန် ၁၀ မိနစ်အနားယူခြင်း ထည့်သွင်းပါ။ • အားလပ်ချိန်ကိုလည်း ချမှတ်ရန် မမေ့ပါနှင့် — ၎င်းသည် အရေးကြီးဆုံးဖြစ်သည်! စီစဉ်ထားခြင်းဖြင့်၊ သင်သည် အချိန်ကို ဉာဏ်ရှိစွာ ထိန်းချုပ်နိုင်သည်။ • တစ်စုံတစ်ရာစီစဉ်ထားသော လုပ်ဆောင်မှုအတွက် နာရီအိုင်ကွန်ကို နှိပ်ပါ။ • ဆက်တင်နှင့် ဦးစားပေးမှုများကို ပြင်ဆင်ရန် မီနူးကို အသုံးပြုပါ။
si: • අවධානය යොමු කරන මිනිත්තු 50ක සැසියන් භාවිතයෙන් ඔබේ දිනය සැලසුම් කරන්න。 • ශක්තිය හා අවධානය පවත්වා ගැනීම සඳහා සැසියන් අතර මිනිත්තු 10ක විවේකයක් ඇතුළත් කරන්න。 • නිදහස් කාලය සැලසුම් කිරීමට අවධානය යොමු කරන්න — මෙය වඩාත්ම වැදගත් කොටසයි! ඔබගේ නිදහස් කාලය කාර්යක්ෂමව පාලනය කිරීම සඳහා ඔබ ව්‍යාපෘතියක් සැලසුම් කරයි。 • කාලසටහන කළ ක්‍රියාවක් සඳහා ටයිමරයක් ආරම්භ කිරීමට ඔරලෝසු අයිකනය තෝරන්න。 • සැකසුම්වලට පිවිසීමට හා ඔබේ මනාපයන් අභිරුචිකරණය කිරීමට මෙනුව භාවිතා කරන්න.
th: • วางแผนทั้งวันของคุณโดยใช้ช่วงเวลาจดจ่อ 50 นาที • แทรกช่วงพัก 10 นาทีระหว่างช่วงเพื่อรักษาพลังงานและสมาธิ • อย่าลืมจัดตารางเวลาว่าง — นี่คือส่วนที่สำคัญที่สุด! ด้วยการวางแผนล่วงหน้า คุณจะจัดการกับเวลาว่างได้อย่างตั้งใจ • แตะที่ไอคอนนาฬิกาเพื่อเริ่มจับเวลาสำหรับกิจกรรมที่กำหนดไว้ • ใช้เมนูเพื่อเข้าถึงการตั้งค่าและปรับแต่งค่าต่าง ๆ
zh: • 使用专注的 50 分钟时间段安排你的一整天。 • 在时间段之间插入 10 分钟的休息，以保持精力和专注力。 • 确保安排自由时间 —— 这是最重要的部分！ 提前安排意味着你可以有意识地管理自由时间，而不是浪费它。 • 点击时钟图标开始任何安排的活动计时器。 • 使用菜单访问设置并自定义你的偏好。

source: Help
hi: सहायता
km: ជំនួយ
lo: ຊ່ວຍເຫຼືອ
my: အကူအညီ
si: උදව්
th: ช่วยเหลือ
zh: 帮助

source: About
hi: परिचय
km: អំពី
lo: ກ່ຽວກັບ
my: အကြောင်း
si: ගැන
th: เกี่ยวกับ
zh: 关于

source: Language
hi: भाषा
km: ភាសា
lo: ພາສາ
my: ဘာသာစကား
si: භාෂාව
th: ภาษา
zh: 语言

source: Timer
hi: टाइमर
km: ម៉ោងจับเวลา
lo: ເວລາ
my: တိုင်းတာစက်
si: ටයිමරය
th: ตัวจับเวลา
zh: 计时器

source: Finished
hi: समाप्त
km: បញ្ចប់រួចរាល់
lo: ສຳເລັດແລ້ວ
my: ပြီးပါပြီ
si: අවසන්
th: เสร็จสิ้น
zh: 已完成

source: Your session has ended.
hi: आपका सत्र समाप्त हो गया है।
km: សម័យរបស់អ្នកបានបញ្ចប់រួចហើយ។
lo: ການເຊັດຊັນຂອງທ່ານໄດ້ສິ້ນສຸດແລ້ວ.
my: သင့်လုပ်ငန်းဆောင်ရွက်မှုပြီးပြီ
si: ඔබගේ සැසිවාරය අවසන් විය
th: เซสชันของคุณสิ้นสุดแล้ว
zh: 您的会话已结束。

# shouldTurnOffNotifcations
source: Turn Off Notifications?
hi: सूचनाएं बंद करें?
km: ចង់បិទការជូនដំណឹងឬ?
lo: ປິດການແຈ້ງເຕືອນບໍ?
my: အသိပေးချက်များပိတ်မလား?
si: දැනුම්දීම් අක්‍රිය කරන්නද?
th: ปิดการแจ้งเตือนหรือไม่?
zh: 要关闭通知吗？

# shouldTurnOnNotifcations
source: Turn On Notifications?
hi: सूचनाएं चालू करें?
km: ចង់បើកការជូនដំណឹងឬ?
lo: ເປີດການແຈ້ງເຕືອນບໍ?
my: အသိပေးချက်များဖွင့်မလား?
si: දැනුම්දීම් සක්‍රිය කරන්නද?
th: เปิดการแจ้งเตือนหรือไม่?
zh: 要开启通知吗？

# thisWillStopFutureNotifications
source: This will stop all future scheduled notifications. Proceed?
hi: यह सभी भविष्य की अनुसूचित सूचनाओं को रोक देगा। क्या आप आगे बढ़ना चाहते हैं?
km: វានឹងបញ្ឈប់ការជូនដំណឹងទាំងអស់នៅពេលអនាគត។ បន្តទេ?
lo: ນີ້ຈະຢຸດການແຈ້ງເຕືອນທັງໝົດໃນອະນາຄົດ. ຈະດຳເນີນຕໍ່ບໍ?
my: ဒါကလာမယ့် နိုတီများကို ရပ်မယ်
si: මෙය අනාගතයේදී නියමිත සියලු දැනුම්දීම් නවත්වනු ඇත. ඉදිරියට යන්නද?
th: สิ่งนี้จะหยุดการแจ้งเตือนทั้งหมดในอนาคต ดำเนินการต่อหรือไม่?
zh: 这将停止所有未来的计划通知。是否继续？

# thisWillEnableAllReminders
source: This will enable reminders for all future scheduled items. Proceed?
hi: यह सभी भविष्य की अनुसूचित वस्तुओं के लिए रिमाइंडर सक्षम करेगा। क्या आप आगे बढ़ना चाहते हैं?
km: វានឹងបើកការរំលឹកសម្រាប់ធាតុដែលបានកំណត់រួចទាំងអស់។ បន្តទេ?
lo: ນີ້ຈະເປີດການແຈ້ງເຕືອນສຳລັບລາຍການໃນອະນາຄົດ. ຈະດຳເນີນຕໍ່ບໍ?
my: ဒီအရာက မျှော်မှန်းထားသော အချိန်ဇယားများအတွက် အသိပေးမှုများကို ဖွင့်ပါမည်။ ဆက်လုပ်မလား?
si: මෙය අනාගත නියමිත අයිතම සඳහා මතක් කිරීම සක්‍රිය කරයි. ඉදිරියට යන්නද?
th: สิ่งนี้จะเปิดการแจ้งเตือนสำหรับรายการที่กำหนดไว้ล่วงหน้าทั้งหมด ดำเนินการต่อหรือไม่?
zh: 这将启用所有未来项目的提醒。是否继续？

source: OK
hi: ठीक है
km: យល់ព្រម
lo: ຕົກລົງ
my: အိုကေ
si: හරි
th: ตกลง
zh: 确定

# timerBypassDndTitle
source: Timer Bypass DND
hi: टाइमर डू नॉट डिस्टर्ब बाईपास
km: បញ្ជាក់ពេលវេលាដើម្បីរំលង DND
lo: ເວລາໄທເມີທີ່ລະເບີດ DND
my: အချိန်ဇယား DND ကျော်ခြင်း
si: ටයිමර් DND මඟහරින්න
th: ตัวจับเวลาไม่รบกวน
zh: 定时器绕过勿扰模式

# timerBypassDndSubtitle
source: Allow timer notification sounds even in DND mode
hi: DND मोड में भी टाइमर नोटिफिकेशन ध्वनियों की अनुमति दें
km: អនុញ្ញាតឲ្យសំឡេងជូនដំណឹងថាជាឧបករណ៍កំណត់ពេលវេលា នៅក្នុងរបៀប DND
lo: ອະນຸຍາດໃຫ້ສຽງແຈ້ງເຕືອນເວລາໄທເມີໃນໂໝດ DND
my: DND မုဒ်တွင် တိုင်မာ အသိပေးသံများ ပြသရန် ခွင့်ပြုပါ
si: DND ප්‍රකාරයේදීත් ටයිමර් දැනුම්දීමේ ශබ්ද අවසර දෙන්න
th: อนุญาตเสียงการแจ้งเตือนของตัวจับเวลาแม้อยู่ในโหมด DND
zh: 即使在勿扰模式下也允许定时器通知声音

# scheduleAlreadyExists
source: Schedule "{name}" already exists
hi: अनुसूची "{name}" पहले से मौजूद है
km: កាលវិភាគ "{name}" មានរួចហើយ
lo: ຕາຕະລາງ "{name}" ມີຢູ່ແລ້ວ
my: အချိန်ဇယား "{name}" ရှိပြီးသားဖြစ်သည်
si: "{name}" කාලසටහන දැනටමත් ඇත
th: กำหนดการ "{name}" มีอยู่แล้ว
zh: 计划 "{name}" 已存在

# renameScheduleTitle
source: Rename Schedule
hi: अनुसूची का नाम बदलें
km: ប្តូរឈ្មោះកាលវិភាគ
lo: ປ່ຽນຊື່ຕາຕະລາງ
my: အချိန်ဇယားအမည်ပြောင်းပါ
si: කාලසටහනේ නම වෙනස් කරන්න
th: เปลี่ยนชื่อตารางเวลา
zh: 重命名计划

# newScheduleAlreadyExists
source: Schedule "{newName}" already exists
hi: अनुसूची "{newName}" पहले से मौजूद है
km: កាលវិភាគ "{newName}" មានរួចហើយ
lo: ຕາຕະລາງ "{newName}" ມີຢູ່ແລ້ວ
my: အချိန်ဇယား "{newName}" ရှိပြီးသားဖြစ်သည်
si: "{newName}" කාලසටහන දැනටමත් ඇත
th: กำหนดการ "{newName}" มีอยู่แล้ว
zh: 计划 "{newName}" 已存在

# deleteScheduleTitle
source: Delete Schedule?
hi: अनुसूची हटाएं?
km: លុបកាលវិភាគ?
lo: ລຶບຕາຕະລາງ?
my: အချိန်ဇယားကိုဖျက်မလား?
si: කාලසටහන මකන්නද?
th: ลบกำหนดการ?
zh: 删除计划？

# deleteScheduleConfirmation
source: Are you sure you want to delete "{_selectedScheduleId}"?
hi: क्या आप वाकई "{_selectedScheduleId}" को हटाना चाहते हैं?
km: តើអ្នកប្រាកដថាចង់លុប "{_selectedScheduleId}" មែនទេ?
lo: ທ່ານແນ່ໃຈບໍ່ວ່າຈະລຶບ "{_selectedScheduleId}"?
my: သင် "{_selectedScheduleId}" ကိုဖျက်ချင်တာသေချာလား?
si: ඔබට "{_selectedScheduleId}" මකන්න ඇවැසි බව විශ්වාසද?
th: คุณแน่ใจหรือไม่ว่าต้องการลบ "{_selectedScheduleId}"?
zh: 您确定要删除 "{_selectedScheduleId}" 吗？

# enableDndBypassTitle
source: Enable Do Not Disturb Bypass
hi: डू नॉट डिस्टर्ब बाईपास सक्षम करें
km: បើកការរំលង DND
lo: ເປີດໃຊ້ການລະເບີດ DND
my: DND ကျော်ခြင်းကိုဖွင့်ပါ
si: DND මඟහරීම් සක්‍රීය කරන්න
th: เปิดใช้งานการข้ามโหมดห้ามรบกวน
zh: 启用勿扰模式绕过

# enableDndBypassMessage
source: To let timer sounds play in Do Not Disturb mode, you need to grant access. Tap "Grant Access" for "My Time Schedule" and then return here and press Continue.
hi: DND मोड में भी टाइमर ध्वनियों को चलाने के लिए, आपको विशेष अनुमति देनी होगी। 'Grant Access' पर टैप करें और वापस आकर 'Continue' दबाएं।
km: ដើម្បីឲ្យសម្លេងព្រមានរបស់ថេម៉ឺបន្ដរដើរបានក្នុងរបៀប DND សូមចុច 'Grant Access' ហើយត្រឡប់មកវិញដើម្បីចុច 'Continue'
lo: ເພື່ອໃຫ້ສຽງແຈ້ງເຕືອນເວລາໄທເມີໃນໂໝດ DND ໃຫ້ໄປທີ່ 'Grant Access' ແລ້ວກັບຄືນມາແລະກົດ 'Continue'
my: DND မုဒ်တွင် တိုင်မာ အသံများထုတ်ရန် 'Grant Access' ကိုနှိပ်ပြီး 'Continue' ကိုနောက်တစ်ကြိမ်နှိပ်ပါ။
si: DND තත්ත්වයේදී ටයිමර් ශබ්ද සඳහා අවසර ලබාදීමට 'Grant Access' තෝරාගෙන පසුව 'Continue' ඔබන්න.
th: เพื่อให้เสียงการจับเวลาเล่นได้ในโหมด DND กรุณาแตะ 'Grant Access' แล้วกลับมากด 'Continue'
zh: 要在勿扰模式中播放定时器声音，请点击“授权访问”，然后返回并点击“继续”。

source: Grant Access
hi: अनुमति दें
km: ផ្តល់ការចូលដំណើរការ
lo: ອະນຸຍາດໃຫ້
my: ခွင့်ပြုပါ
si: අවසර දෙන්න
th: ให้สิทธิ์การเข้าถึง
zh: 授予访问权限

# finishSetupTitle
source: Finish Setup
hi: सेटअप पूरा करें
km: បញ្ចប់ការរៀបចំ
lo: ສິ້ນສຸດການຕິດຕັ້ງ
my: ဆက်တပ်ခြင်းကိုပြီးမြောက်ပါ
si: සැකසීම නිමා කරන්න
th: เสร็จสิ้นการตั้งค่า
zh: 完成设置

# finishSetupMessage
source: After granting permission, press Continue.
hi: अनुमति देने के बाद, जारी रखें दबाएं।
km: បន្ទាប់ពីអនុញ្ញាត សូមចុចបន្ត
lo: ຫຼັງຈາກໄດ້ອະນຸຍາດແລ້ວ, ກົດປຸ່ມດຳເນີນການຕໍ່
my: ခွင့်ပြုပြီးနောက် 'Continue' ကိုနှိပ်ပါ
si: අවසර දුන් පසුව 'Continue' ඔබන්න
th: หลังจากอนุญาตแล้วให้กด 'ดำเนินการต่อ'
zh: 授权后点击“继续”

# continueLabel
source: Continue
hi: जारी रखें
km: បន្ត
lo: ດຳເນີນຕໍ່
my: ဆက်လက်လုပ်ဆောင်ပါ
si: ඉදිරියට යන්න
th: ดำเนินการต่อ
zh: 继续

source: Meditation
hi: ध्यान
km: ធ្វើសមាធិ
lo: ສະຫງົບໃຈ
my: တရားထိုင်ခြင်း
si: භාවනාව
th: สมาธิ
zh: 冥想

# notificationsTurnedOff
source: Notifications have been turned off. You need to toggle the bell icon (🔔) to turn them on again.
hi: सूचनाएं बंद कर दी गई हैं। उन्हें फिर से चालू करने के लिए आपको घंटी आइकन (🔔) को टॉगल करना होगा।
km: ការជូនដំណឹងត្រូវបានបិទ។ សូមបើកវាវិញដោយចុចសញ្ញាកណ្ដឹង (🔔)
lo: ແຈ້ງເຕືອນໄດ້ຖືກປິດແລ້ວ. ໃຫ້ເປີດຄືນໃຫ້ກົດໄອຄອນກະດິ່ງ (🔔)
my: အသိပေးချက်များကို ပိတ်ထားသည်။ ပြန်ဖွင့်ရန် သင်သည် ခေါင်းလောင်းအိုင်ကွန် (🔔) ကို တက်ဂယ်လုပ်ရမည်။
si: දැනුම්දීම් අක්‍රිය කර ඇත. නැවත සක්‍රිය කිරීමට ඔබට ගංඟු ආයිකනය (🔔) මත ක්ලික් කළ යුතුය.
th: การแจ้งเตือนถูกปิดไว้ คุณต้องกดสัญลักษณ์กระดิ่ง (🔔) เพื่อเปิดอีกครั้ง
zh: 通知已关闭。您需要点击铃铛图标 (🔔) 重新开启它们。

source: Rate this app
hi: इस ऐप को रेट करें
km: ໃຫ້ຄະແນນແອັບນີ້
lo: វាយតម្លៃកម្មវិធីនេះ
my: ဒီအပ်ကိုအဆင့်သတ်မှတ်ပါ
si: මෙම යෙදුම තක්සේරු කරන්න
th: ให้คะแนนแอปนี้
zh: 为此应用评分

source: Select a Schedule
hi: एक समय तालिका चुनें
km: ជ្រើសរើសកាលវិភាគ
lo: ເລືອກຕາຕະລາງ
my: အချိန်ဇယားကို ရွေးပါ
si: කාලසටහනක් තෝරන්න
th: เลือกตารางเวลา
zh: 选择一个时间表

source: Download Public Schedule
hi: सार्वजनिक समय तालिका डाउनलोड करें
km: ទាញយកកាលវិភាគសាធារណៈ
lo: ດາວໂຫຼດຕາຕະລາງສາທາລະນະ
my: အများပြည်သူအချိန်ဇယားကိုဒေါင်းလုတ်လုပ်ပါ
si: පොදු කාලසටහන බාගන්න
th: ดาวน์โหลดตารางเวลาสาธารณะ
zh: 下载公开时间表

source: Share This App
hi: इस ऐप को साझा करें
km: ចែករំលែកកម្មវិធីនេះ
lo: ແບ່ງປັນແອັບນີ້
my: ဤအက်ပ်ကိုမျှဝေပါ
si: මෙම යෙදුම බෙදාගන්න
th: แชร์แอปนี้
zh: 分享此应用

# shareAppMessage
source: 🧘 Check out the My Time Schedule app for mindfulness and daily routine tracking! Download it here: For Android: https://play.google.com/store/apps/details?id=org.americanmonk.mytimeschedule For Apple:https://apps.apple.com/us/developer/path-nirvana-foundation/id1434955292
hi: 🧘 ध्यान और दैनिक दिनचर्या को ट्रैक करने के लिए My Time Schedule ऐप आज़माएँ! डाउनलोड करें: Android के लिए: https://play.google.com/store/apps/details?id=org.americanmonk.mytimeschedule Apple के लिए: https://apps.apple.com/us/developer/path-nirvana-foundation/id1434955292
km: 🧘 សាកល្បងកម្មវិធី My Time Schedule ដើម្បីតាមដានការដឹកនាំផ្លូវចិត្ត និងកាលវិភាគប្រចាំថ្ងៃ! ទាញយកនៅទីនេះ: សម្រាប់ Android: https://play.google.com/store/apps/details?id=org.americanmonk.mytimeschedule សម្រាប់ Apple: https://apps.apple.com/us/developer/path-nirvana-foundation/id1434955292
lo: 🧘 ລອງໃຊ້ແອັບ My Time Schedule ເພື່ອຕິດຕາມຄວາມຮູ້ສຶກແລະຕາຕະລາງປະຈຳວັນ ດາວໂຫຼດໄດ້ທີ່: ສໍາລັບ Android: https://play.google.com/store/apps/details?id=org.americanmonk.mytimeschedule ສໍາລັບ Apple: https://apps.apple.com/us/developer/path-nirvana-foundation/id1434955292
my: 🧘 သင့်စိတ်နှင့်နေ့စဉ်အချိန်ဇယားကို စောင့်ကြည့်ရန် My Time Schedule အက်ပ်ကို အသုံးပြုပါ! ဒေါင်းလုပ်လုပ်ရန်: Android အတွက်: https://play.google.com/store/apps/details?id=org.americanmonk.mytimeschedule Apple အတွက်: https://apps.apple.com/us/developer/path-nirvana-foundation/id1434955292
si: 🧘 භාවනා සහ දෛනික කාලසටහන් සටහන් කිරීමට My Time Schedule යෙදුම උත්සාහ කරන්න! බාගත කරන්න: Android සඳහා: https://play.google.com/store/apps/details?id=org.americanmonk.mytimeschedule Apple සඳහා: https://apps.apple.com/us/developer/path-nirvana-foundation/id1434955292
th: 🧘 ลองใช้แอป My Time Schedule เพื่อติดตามการฝึกสติและกิจวัตรประจำวันของคุณ ดาวน์โหลดได้ที่: สำหรับ Android: https://play.google.com/store/apps/details?id=org.americanmonk.mytimeschedule สำหรับ Apple: https://apps.apple.com/us/developer/path-nirvana-foundation/id1434955292
zh: 🧘 尝试使用 My Time Schedule 应用来跟踪正念修行和日常安排！ 下载地址： Android版： https://play.google.com/store/apps/details?id=org.americanmonk.mytimeschedule Apple版： https://apps.apple.com/us/developer/path-nirvana-foundation/id1434955292

source: One Hour Display Mode
hi: एक घंटे का प्रदर्शन मोड
km: របៀបបង្ហាញមួយម៉ោង
lo: ໂຫມດສະແດງ 1 ຊົ່ວໂມງ
my: ၁ နာရီပြသမှုရုပ်ပုံ
si: පැය 1ක් පමණක් පෙන්වීමේ ආකාරය
th: โหมดแสดงผล 1 ชั่วโมง
zh: 一小时显示模式

source: Full Time Display Mode
hi: पूर्ण समय प्रदर्शन मोड
km: របៀបបង្ហាញពេញម៉ោង
lo: ໂຫມດສະແດງເວລາເຕັມ
my: အပြည့်အ زمانیပြသမှုရုပ်ပုံ
si: සම්පූර්ණ කාල පෙන්වීමේ ආකාරය
th: โหมดแสดงผลเต็มเวลา
zh: 完整时间显示模式

# timerBypassMessage
source: Timer > 1 hour – showing full duration
hi: टाइमर 1 घंटे से अधिक है – पूर्ण अवधि दिखा रहा है
km: គ្រោងម៉ោង > 1 ម៉ោង – កំពុងបង្ហាញរយៈពេលពេញ
lo: ເວລາເກີນ 1 ຊົ່ວໂມງ – ສະແດງເວລາເຕັມ
my: အချိန်တိုင်းကိရိယာ > ၁ နာရီ – အချိန်အပြည့်ပြသနေသည်
si: ටයිමරය පැය 1කට වඩා වැඩියි – සම්පූර්ණ කාලය පෙන්වයි
th: ตัวจับเวลา > 1 ชั่วโมง – แสดงระยะเวลาเต็ม
zh: 计时器超过1小时 – 显示完整时长

source: Dark Mode
km: របៀបងងឹត
my: အမှောင်မုဒ်
si: අඳුරු මාදිලිය
